app/controllers/books_controller.rb

    def index
        # @book = Book.new
        @books = Book.all
---
SELECT "books".* FROM "books"

    def corect_user
        book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]