app/controllers/users_controller.rb

	def update
		@user = User.find(params[:id])
    	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "3a4202b5bc8d25fb1e5611f30d868ab5f266edab64be2fab4641a6c1321e"], ["updated_at", "2019-06-19 08:24:19.884619"], ["id", 4]]

	def show
		@users = User.all
		@user = User.find(params[:id])
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def corect_user
		user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]